#include <stdio.h>//通过预处理声明标准输入输出函数库
int main()//声明主函数
{
    int a=3,b=4,c;//声明三个变量a,b,c;其中c的作用是做中间值辅助完成值的互换
    int *p=&a;//定义指针p=&a,则*p=a=3
    int *q=&b;//定义指针q=&b,则*q=b=4
    printf("交换前p,q的值为:%d;%d\n",*p,*q);//先输出原先值，方便与后面值的互换后形成对比
    c=*p;//将指针p的值赋值给中间值c，此时c=*p=a=3,即c=*p
    *p=*q;//将指针q的值赋值给*p,此时*p=*q=b=4，即*p=*q
    *q=c;//将指针p的原先的值通过中间值c赋值给8q，此时*q=c=*p(原)=3
    printf("交换后p,q的值为:%d;%d",*p,*q);//输出互换后的值
    return 0;//返回值
}//因为*p,*q是指针指向变量的现实值，相当于普通变量。所以通过中间值进行变量值的互换的方法也可以用于指针现实值的互换